{
  "content": {
    "2": "I spent the past summer volunteering for a local food bank in Chinatown. I went every Monday to help the food bank with one task: Give food to Chinese seniors living in subsidized housing. It was my first time ever doing something like this. I did it on a whim. I would go to school and see a lineup by the food bank. Out of curiosity, I searched up the food bank and saw that there was a way to volunteer. That's what I did. Despite applying late, I somehow got in. I don't regret it one bit.\n\nMy main task consisted of bringing food from the food bank over to the housing projects, package the food into grocery bags, and distribute them floor by floor. A distinct thing I remember explaining was my background and how it didn't match that of typical volunteers at the food bank. For context, I'm a computer science major. When I was asked why I volunteered for the food bank, I didn't exactly give a straight answer. Luckily, a simple \"I always saw the big lines on my way to school and wanted to help out\" sufficed as an explanation.\n\nDeep down, I knew it was for another reason: to see how other people suffered that I didn't yet know or understand. I understood that I lived a comfortable life. I was a university student. I had food on the table. I had everything in life that I needed to live meaningfully. All this made me realize that there was a side to life that I wasn't exposed to. The side of life where people struggled to live. Starvation. Poverty. All these things occur in someone's worldview close to you. I wanted to be someone that understood as much of the world as possible. I was afraid that my ignorance of people different from my background would render me naive.\n\nEvery Monday I went in. I saw people smiling and hugging each other. Despite the challenges they may have faced or the situation that they were in, they still had that ability to smile and enjoy the present moment. It's a testament to their mental resilience. It's also a testament to their ability to let go of the past and to be grateful in the present moment.\n\nI learned this as I went in each Monday to volunteer. Being surrounded by the volunteers, and meeting those that needed the food rations each Monday, made me more appreciative and grateful for my life. It's helped me learn to let go of the past in order to focus on the present moment. As a young kid, I always had a hard time letting go. Mistakes, regrets, and mishaps all added up to mentally incapacitate me. I've learned to let go of the past - whether good or bad - to focus on the present moment. Holding on to the good things in life, like accolades, achievements, and cause you to be egotistical by potentially inflating your self worth. Holding on to the bad things can prevent you from focusing on what you need to do in the present moment to succeed and be fulfilled. I learned that you have to let go of both to focus on the present moment, no matter what.\n\n This way, all your energy is focused on the present moment. I would argue that of all the things, making the most of the present matters the most."
  }
}
